# SpatialFieldMgrResultsVisibility Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpatialFieldMgrResultsVisibility Property
ParameterTypeId Class See Also
---
"Results Visibility"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpatialFieldMgrResultsVisibility { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpatialFieldMgrResultsVisibility As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpatialFieldMgrResultsVisibility {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace